{
  "name": "Web App prompts \u0026 feedback",
  "color": "#465A64",
  "items": [
    {
      "objectId": "messages_history",
      "objectType": "DATASET"
    },
    {
      "objectId": "user_profiles",
      "objectType": "DATASET"
    },
    {
      "objectId": "general_feedback",
      "objectType": "DATASET"
    },
    {
      "objectId": "conversation_history",
      "objectType": "DATASET"
    }
  ],
  "shared": [],
  "position": {
    "x": 141.50327841485137,
    "y": 207.13982678056215,
    "width": 424.0,
    "height": 424.0
  },
  "description": "This data processing flow is designed to manage and analyze interactions between users and a large language model (LLM) in the context of loan application discussions. The flow takes in several input datasets, each capturing different aspects of user interactions and feedback.\n\nThe input datasets include:\n\n1. **Conversation History**: This dataset records detailed information about each conversation related to loan applications, including the conversation ID, user questions, LLM responses, feedback, and timestamps. It also tracks the knowledge bank and LLM used, as well as any media generated during the conversation.\n\n2. **User Profiles**: This dataset contains information about users, including their profiles and the last time these profiles were updated. It helps in understanding user-specific interactions and preferences.\n\n3. **General Feedback**: This dataset captures user feedback on interactions with the LLM, including the content of feedback messages and references to the knowledge bank and LLM involved.\n\n4. **Messages History**: This dataset logs individual messages exchanged between users and the LLM, detailing the platform used, the queries and responses, and any filters or sources applied during the interaction.\n\nThe flow processes these datasets to produce an output dataset called **Conversation History**. This output dataset consolidates and enriches the information from the input datasets, providing a comprehensive view of each conversation. It includes details such as the conversation ID, user questions, LLM responses, feedback, and timestamps, along with contextual information like the knowledge bank and LLM used. The output dataset is crucial for analyzing user interactions, assessing the effectiveness of the LLM, and improving the overall user experience in loan application discussions.",
  "tags": [],
  "customFields": {},
  "checklists": {
    "checklists": []
  }
}